sterentev/atdf-device-asm-include/inc/ATmega8HVA.inc
;***********************************************************************
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ******************
;*************** Script version: 0.07 **********************************
;*************** tab-width 8 *******************************************
;***********************************************************************
;
;* Target MCU        : ATmega8HVA
;* Title             : Register/Mask/Bit Definitions for the ATmega8HVA
;* File Name         : ATmega8HVA.inc
;* Source Date       : 2026-01-22 07:11:00 UTC
;* Make Date         : 2026-05-31 13:22:31 UTC
;
;***********************************************************************

#ifndef _ATMEGA8HVA_INC_
#define _ATMEGA8HVA_INC_

;***********************************************************************
;********************* NOTES *******************************************
;***********************************************************************
;
; - Registers marked [MEMORY MAPPED] are extended I/O ports
;   and cannot be used with IN/OUT instructions
; - Register bits are specified by a bit number (for a single bit)
;   xor by mask (for bits group). In case bits in a group are placed sequentially
;   to each other (no gaps) a number for the lower bit in the group is defined also.
; - When a set of bitmask values is listed for bits group,
;   use those values without bit shifting operation
; - Some bitmasks MCU developers split on 2+ chunks and placed separately
;   (sometime in different registers). Such bitmaps are placed in
;   'EXTRA BITFIELDS VALUES' section. Refer to docs where such bits should be set.
;
;***********************************************************************




; **********************************************************************
; ***************	DEVICE DEFINITIONS	************************
; **********************************************************************
;
.device	ATmega8HVA
.equ	JTAGID		= 0x9310
.equ	SIGNATURE0	= 0x1e
.equ	SIGNATURE1	= 0x93
.equ	SIGNATURE2	= 0x10


; ************* CPU REGISTERS DEFINITIONS ******************************
;
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30



; **********************************************************************
; ***************	ADDR SPACES AND MAPPING	************************
; **********************************************************************
;
; ----------	PROG ADDRESS SPACE		------------------------
;   FLASH
.equ	ADDR_FLASH_START		= 0x0000
.equ	ADDR_FLASH_END			= 0x1FFF
.equ	ADDR_FLASH_SIZE			= 0x2000

; ----------	SIGNATURES ADDRESS SPACE	------------------------
;   SIGNATURES
.equ	ADDR_SIGNATURES_START		= 0x0000
.equ	ADDR_SIGNATURES_END		= 0x0002
.equ	ADDR_SIGNATURES_SIZE		= 0x0003

; ----------	FUSES ADDRESS SPACE		------------------------
;   FUSES
.equ	ADDR_FUSES_START		= 0x0000
.equ	ADDR_FUSES_END			= 0x0000
.equ	ADDR_FUSES_SIZE			= 0x0001

; ----------	LOCKBITS ADDRESS SPACE		------------------------
;   LOCKBITS
.equ	ADDR_LOCKBITS_START		= 0x0000
.equ	ADDR_LOCKBITS_END		= 0x0000
.equ	ADDR_LOCKBITS_SIZE		= 0x0001

; ----------	DATA ADDRESS SPACE		------------------------
;   REGISTERS
.equ	ADDR_REGISTERS_START		= 0x0000
.equ	ADDR_REGISTERS_END		= 0x001F
.equ	ADDR_REGISTERS_SIZE		= 0x0020
;   MAPPED_IO
.equ	ADDR_MAPPED_IO_START		= 0x0020
.equ	ADDR_MAPPED_IO_END		= 0x00FF
.equ	ADDR_MAPPED_IO_SIZE		= 0x00E0
;   IRAM
.equ	ADDR_IRAM_START			= 0x0100
.equ	ADDR_IRAM_END			= 0x02FF
.equ	ADDR_IRAM_SIZE			= 0x0200

; ----------	EEPROM ADDRESS SPACE		------------------------
;   EEPROM
.equ	ADDR_EEPROM_START		= 0x0000
.equ	ADDR_EEPROM_END			= 0x00FF
.equ	ADDR_EEPROM_SIZE		= 0x0100




; **********************************************************************
; ***************	FUSES REGISTERS		************************
; **********************************************************************
;
.equ	LOW		= 0x00


; ====	FUSE MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register LOW bits		------------------------
.equ	WDTON		= 7		; 0x80 - Watch-dog Timer always on
.equ	EESAVE		= 6		; 0x40 - Preserve EEPROM through the Chip Erase cycle
.equ	SPIEN		= 5		; 0x20 - Serial program downloading (SPI) enabled
.equ	DWEN		= 4		; 0x10 - Debug Wire enable
.equ	SELFPRGEN	= 3		; 0x08 - Self Programming enable
.equ	SUT_MASK	= 0x07		;      - Select start-up time (3 bits)
.equ	SUT0		= 0		;          SUT BIT0 position
; ::::  SUT	:::: bitfield values
;			0x00		; Start-up time 6 CK/14 CK + 4 ms
;			0x01		; Start-up time 6 CK/14 CK + 8 ms
;			0x02		; Start-up time 6 CK/14 CK + 16 ms
;			0x03		; Start-up time 6 CK/14 CK + 32 ms
;			0x04		; Start-up time 6 CK/14 CK + 64 ms
;			0x05		; Start-up time 6 CK/14 CK + 128 ms
;			0x06		; Start-up time 6 CK/14 CK + 256 ms
;			0x07		; Start-up time 6 CK/14 CK + 512 ms




; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	BPPLR		= 0xFE		; [MEMORY MAPPED] Battery Protection Parameter Lock Register
.equ	BPCR		= 0xFD		; [MEMORY MAPPED] Battery Protection Control Register
.equ	BPHCTR		= 0xFC		; [MEMORY MAPPED] Battery Protection Short-current Timing Register
.equ	BPOCTR		= 0xFB		; [MEMORY MAPPED] Battery Protection Over-current Timing Register
.equ	BPSCTR		= 0xFA		; [MEMORY MAPPED] Battery Protection Short-current Timing Register
.equ	BPCHCD		= 0xF9		; [MEMORY MAPPED] Battery Protection Charge-High-current Detection Level Register
.equ	BPDHCD		= 0xF8		; [MEMORY MAPPED] Battery Protection Discharge-High-current Detection Level Register
.equ	BPCOCD		= 0xF7		; [MEMORY MAPPED] Battery Protection Charge-Over-current Detection Level Register
.equ	BPDOCD		= 0xF6		; [MEMORY MAPPED] Battery Protection Discharge-Over-current Detection Level Register
.equ	BPSCD		= 0xF5		; [MEMORY MAPPED] Battery Protection Short-Circuit Detection Level Register
.equ	BPIFR		= 0xF3		; [MEMORY MAPPED] Battery Protection Interrupt Flag Register
.equ	BPIMSK		= 0xF2		; [MEMORY MAPPED] Battery Protection Interrupt Mask Register
.equ	FCSR		= 0xF0		; [MEMORY MAPPED] FET Control and Status Register
.equ	CADIC		= 0xE8		; [MEMORY MAPPED] CC-ADC Instantaneous Current
.equ	CADRC		= 0xE6		; [MEMORY MAPPED] CC-ADC Regular Current
.equ	CADCSRB		= 0xE5		; [MEMORY MAPPED] CC-ADC Control and Status Register B
.equ	CADCSRA		= 0xE4		; [MEMORY MAPPED] CC-ADC Control and Status Register A
.equ	CADAC3		= 0xE3		; [MEMORY MAPPED] ADC Accumulate Current
.equ	CADAC2		= 0xE2		; [MEMORY MAPPED] ADC Accumulate Current
.equ	CADAC1		= 0xE1		; [MEMORY MAPPED] ADC Accumulate Current
.equ	CADAC0		= 0xE0		; [MEMORY MAPPED] ADC Accumulate Current
.equ	BGCRR		= 0xD1		; [MEMORY MAPPED] Bandgap Calibration of Resistor Ladder
.equ	BGCCR		= 0xD0		; [MEMORY MAPPED] Bandgap Calibration Register
.equ	ROCR		= 0xC8		; [MEMORY MAPPED] Regulator Operating Condition Register
.equ	OCR1B		= 0x89		; [MEMORY MAPPED] Output Compare Register B
.equ	OCR1A		= 0x88		; [MEMORY MAPPED] Output Compare Register 1A
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] Timer Counter 1  Bytes
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1A		= 0x80		; [MEMORY MAPPED] Timer/Counter 1 Control Register A
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register
.equ	VADMUX		= 0x7C		; [MEMORY MAPPED] The VADC multiplexer Selection Register
.equ	VADCSR		= 0x7A		; [MEMORY MAPPED] The VADC Control and Status register
.equ	VADC		= 0x78		; [MEMORY MAPPED] VADC Data Register  Bytes
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register
.equ	FOSCCAL		= 0x66		; [MEMORY MAPPED] Fast Oscillator Calibration Value
.equ	PRR0		= 0x64		; [MEMORY MAPPED] Power Reduction Register 0
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] Clock Prescale Register
.equ	WDTCSR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	SPMCSR		= 0x37		; Store Program Memory Control and Status Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	SPSR		= 0x2D		; SPI Status Register
.equ	SPCR		= 0x2C		; SPI Control Register
.equ	GPIOR2		= 0x2B		; General Purpose IO Register 2
.equ	GPIOR1		= 0x2A		; General Purpose IO Register 1
.equ	OCR0B		= 0x29		; Output compare Register B
.equ	OCR0A		= 0x28		; Output compare Register A
.equ	TCNT0		= 0x26		; Timer Counter 0  Bytes
.equ	TCCR0B		= 0x25		; Timer/Counter0 Control Register
.equ	TCCR0A		= 0x24		; Timer/Counter0 Control Register
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	EEAR		= 0x21		; EEPROM Read/Write Access
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General Purpose IO Register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	OSICSR		= 0x17		; Oscillator Sampling Interface Control and Status Register
.equ	TIFR1		= 0x16		; Timer/Counter Interrupt Flag register
.equ	TIFR0		= 0x15		; Timer/Counter Interrupt Flag register
.equ	PORTC		= 0x08		; Port C Data Register
.equ	PINC		= 0x06		; Port C Input Pins
.equ	PORTB		= 0x05		; Data Register, Port B
.equ	DDRB		= 0x04		; Data Direction Register, Port B
.equ	PINB		= 0x03		; Input Pins, Port B
.equ	PORTA		= 0x02		; Port A Data Register
.equ	DDRA		= 0x01		; Port A Data Direction Register
.equ	PINA		= 0x00		; Port A Input Pins


; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register VADMUX bits		------------------------
.equ	VADMUX_MASK	= 0x0F		;      - Analog Channel and Gain Selection Bits (4 bits)
.equ	VADMUX0		= 0		;          VADMUX BIT0 position

