sterentev/atdf-device-asm-include/inc/ATmega8HVA.inc
; ----------	Register TIFR1 bits		------------------------
.equ	ICF1		= 3		; 0x08 - Timer/Counter 1 Input Capture Flag
.equ	OCF1B		= 2		; 0x04 - Timer/Counter1 Output Compare Flag B
.equ	OCF1A		= 1		; 0x02 - Timer/Counter1 Output Compare Flag A
.equ	TOV1		= 0		; 0x01 - Timer/Counter1 Overflow Flag

; ----------	Register GTCCR bits		------------------------
.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset

; ----------	Register TCCR0A bits		------------------------
.equ	TCW0		= 7		; 0x80 - Timer/Counter Width
.equ	ICEN0		= 6		; 0x40 - Input Capture Mode Enable
.equ	ICNC0		= 5		; 0x20 - Input Capture Noise Canceler
.equ	ICES0		= 4		; 0x10 - Input Capture Edge Select
.equ	ICS0		= 3		; 0x08 - Input Capture Select
.equ	WGM00		= 0		; 0x01 - Clock Select0 bit 0

; ----------	Register TCCR0B bits		------------------------
.equ	CS02		= 2		; 0x04 - Clock Select0 bit 2
.equ	CS01		= 1		; 0x02 - Clock Select0 bit 1
.equ	CS00		= 0		; 0x01 - Clock Select0 bit 0

; ----------	Register TIMSK0 bits		------------------------
.equ	ICIE0		= 3		; 0x08 - Timer/Counter n Input Capture Interrupt Enable
.equ	OCIE0B		= 2		; 0x04 - Output Compare Interrupt Enable
.equ	OCIE0A		= 1		; 0x02 - Output Compare Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	ICF0		= 3		; 0x08 - Timer/Counter Interrupt Flag Register
.equ	OCF0B		= 2		; 0x04 - Output Compare Flag
.equ	OCF0A		= 1		; 0x02 - Output Compare Flag
.equ	TOV0		= 0		; 0x01 - Overflow Flag



; ====	COULOMB_COUNTER MODULE REGISTERS BITS DEFINITION========
;
; ----------	Register CADCSRA bits		------------------------
.equ	CADEN		= 7		; 0x80 - When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled.
.equ	CADPOL		= 6		; 0x40 - 
.equ	CADUB		= 5		; 0x20 - CC_ADC Update Busy
.equ	CADAS_MASK	= 0x18		;      - CC_ADC Accumulate Current Select Bits (2 bits)
.equ	CADAS0		= 3		;          CADAS BIT0 position
.equ	CADSI_MASK	= 0x06		;      - The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined. (2 bits)
.equ	CADSI0		= 1		;          CADSI BIT0 position
.equ	CADSE		= 0		; 0x01 - When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode.

; ----------	Register CADCSRB bits		------------------------
.equ	CADACIE		= 6		; 0x40 - 
.equ	CADRCIE		= 5		; 0x20 - Regular Current Interrupt Enable
.equ	CADICIE		= 4		; 0x10 - CAD Instantaneous Current Interrupt Enable
.equ	CADACIF		= 2		; 0x04 - CC-ADC Accumulate Current Interrupt Flag
.equ	CADRCIF		= 1		; 0x02 - CC-ADC Accumulate Current Interrupt Flag
.equ	CADICIF		= 0		; 0x01 - CC-ADC Instantaneous Current Interrupt Flag



; ====	VOLTAGE_REGULATOR MODULE REGISTERS BITS DEFINITION========
;
; ----------	Register ROCR bits		------------------------
.equ	ROCS		= 7		; 0x80 - ROC Status
.equ	ROCWIF		= 1		; 0x02 - ROC Warning Interrupt Flag
.equ	ROCWIE		= 0		; 0x01 - ROC Warning Interrupt Enable




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 21
.equ	INT_VECTORS_SIZE	= 0x2A
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;	1	BPINT		; Battery Protection Interrupt
;	2	VREGMON		; Voltage regulator monitor interrupt
;	3	INT0		; External Interrupt Request 0
;	4	INT1		; External Interrupt Request 1
;	5	INT2		; External Interrupt Request 2
;	6	WDT		; Watchdog Timeout Interrupt
;	7	TIMER1_IC	; Timer 1 Input capture
;	8	TIMER1_COMPA	; Timer 1 Compare Match A
;	9	TIMER1_COMPB	; Timer 1 Compare Match B
;	10	TIMER1_OVF	; Timer 1 overflow
;	11	TIMER0_IC	; Timer 0 Input Capture
;	12	TIMER0_COMPA	; Timer 0 Compare Match A
;	13	TIMER0_COMPB	; Timer 0 Compare Match B
;	14	TIMER0_OVF	; Timer 0 Overflow
;	15	SPI_STC		; SPI Serial transfer complete
;	16	VADC		; Voltage ADC Conversion Complete
;	17	CCADC_CONV	; Coulomb Counter ADC Conversion Complete
;	18	CCADC_REG_CUR	; Coloumb Counter ADC Regular Current
;	19	CCADC_ACC	; Coloumb Counter ADC Accumulator
;	20	EE_READY	; EEPROM Ready


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		reti			; BPINT		 - Battery Protection Interrupt
;#		reti			; VREGMON	 - Voltage regulator monitor interrupt
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; WDT		 - Watchdog Timeout Interrupt
;#		reti			; TIMER1_IC	 - Timer 1 Input capture
;#		reti			; TIMER1_COMPA	 - Timer 1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer 1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer 1 overflow
;#		reti			; TIMER0_IC	 - Timer 0 Input Capture
;#		reti			; TIMER0_COMPA	 - Timer 0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer 0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer 0 Overflow
;#		reti			; SPI_STC	 - SPI Serial transfer complete
;#		reti			; VADC		 - Voltage ADC Conversion Complete
;#		reti			; CCADC_CONV	 - Coulomb Counter ADC Conversion Complete
;#		reti			; CCADC_REG_CUR	 - Coloumb Counter ADC Regular Current
;#		reti			; CCADC_ACC	 - Coloumb Counter ADC Accumulator
;#		rjmp	EE_READY_ISR	; EE_READY	 - EEPROM Ready
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA8HVA_INC_ */

; ************************ END OF FILE *********************************

